# Игра крестики нолики
#
# Приветствие
print('_______________\n'
      'Приветсвуем вас\n'
      '    в игре\n'
      'крестики-нолики\n'
      '_______________')
print('Формат ввода: x, y\n'
      'x - № строки\n'
      'y - № столбеца\n'
      'Ввод координат через пробел!')

# Создаем функцию для формирования и вывода таблицы
def show():
    print() # Вывод пустой строки в консоль
    print('      0 | 1 | 2 |')
    print(' ----------------')
    for i, row in enumerate(field):
        row_str = f"  {i} | {' | '.join(row)} | " # Формирование строк и столбцов
        print(row_str) # Поэтапный вывод полученных строк в консоль
        print(' ----------------')
    print() # Вывод пустой строки в консоль

# Запрашиваем у пользователя координаты
def ask():
    while True: # Выволнять цикл пока True
        cords = input('     Ваш ход: ').split()

        if len(cords) != 2: # Проверка на количество координат
            print('Введите 2 координаты!')
            continue

        x, y = cords

        if not(x.isdigit()) or not(y.isdigit()): # Проверка введеных данных на наличие других символов
            print('Введите числа!')
            continue

        x, y = int(x), int(y)

        if 0 <= x <= 2 and 0 <= x <= 2: # Проверка x и y, входят ли они в диапазон
            if field[x][y] == ' ': # Проверка, не занята ли ячейка таблицы
                return x, y
            else:
                print('Ячейка занята!')
        else:
            print('Координаты вне диапазона!')

# Проверка согласно правилам игры
def check_win():
    win_cord = (((0, 0), (0, 1), (0, 2)), ((1, 0), (1, 1), (1, 2)), ((2, 0), (2, 1), (2, 2)),
                ((0, 2), (1, 1), (2, 0)), ((0, 0), (1, 1), (2, 2)), ((0, 0), (1, 0), (2, 0)),
                ((0, 1), (1, 1), (2, 1)), ((0, 2), (1, 2), (2, 2)))
    for cord in win_cord:
        symbols = []
        for c in cord:
            symbols.append(field[c[0]][c[1]])
        if symbols == ['X', 'X', 'X']:
            show()
            print('Выиграл крестик!!!')
            return True
        if symbols == ['0', '0', '0']:
            show()
            print('Выиграл нолик!!!')
            return True
    return False

# Создаем пустой массив из 9 ячеек
field = [
    [' '] * 3,
    [' '] * 3,
    [' '] * 3
]
# Определяем очередность хода
num = 0
while True:
    num += 1
    show()
    if num % 2 == 1:
        print(" Ходит крестик!")
    else:
        print(" Ходит нолик!")

    x, y = ask()

    if num % 2 == 1:
        field[x][y] = "X"
    else:
        field[x][y] = "0"

    if check_win():
        break

    if num == 9:
        print(" Ничья!")
        break
